tests/performance/endurance-test.yml
config:
  target: 'http://localhost:8000'
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 1800
      arrivalRate: 15
      name: "Endurance test"
    - duration: 60
      arrivalRate: 5
      name: "Cool down"
  defaults:
    headers:
      Content-Type: 'application/json'

scenarios:
  - name: "Endurance Health Checks"
    weight: 40
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200

  - name: "Endurance API Calls"
    weight: 40
    flow:
      - get:
          url: "/api/v1/health"
          expect:
            - statusCode: 200
      - get:
          url: "/ready"
          expect:
            - statusCode: 200

  - name: "Endurance Authentication"
    weight: 20
    flow:
      - post:
          url: "/api/v1/auth/register"
          json:
            email: "endurance{{ $randomInt(1, 10000000) }}@example.com"
            password: "EnduranceTest123!"
            full_name: "Endurance User {{ $randomInt(1, 10000000) }}"
          expect:
            - statusCode: [200, 201, 400, 409]