tests/performance/endurance-test.yml
# Artillery Endurance Test Configuration
# Tests system behavior over extended periods

config:
  target: 'http://localhost:8000'
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 1800
      arrivalRate: 15
      name: "Extended load (30 minutes)"
    - duration: 60
      arrivalRate: 5
      name: "Cool down"
  defaults:
    headers:
      Content-Type: 'application/json'
  plugins:
    metrics-by-endpoint: {}
    expect: {}

scenarios:
  - name: "Endurance Health Monitoring"
    weight: 25
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200

  - name: "Endurance User Activity"
    weight: 30
    flow:
      - post:
          url: "/api/v1/auth/register"
          json:
            email: "endurance{{ $randomString() }}@example.com"
            password: "EndurancePassword123!"
            full_name: "Endurance User {{ $randomString() }}"
            mobile_phone: "+123456789{{ $randomInt(1000, 9999) }}"
          expect:
            - statusCode: 201

  - name: "Endurance Document Processing"
    weight: 25
    flow:
      - post:
          url: "/api/v1/documents/upload"
          formData:
            file: "@tests/fixtures/sample.pdf"
          expect:
            - statusCode: 200

  - name: "Endurance Chat Activity"
    weight: 20
    flow:
      - post:
          url: "/api/v1/chat/message"
          json:
            message: "Endurance test message {{ $randomString() }}"
            session_id: "endurance-session-{{ $randomString() }}"
          expect:
            - statusCode: 200