tests/performance/spike-test.yml
# Artillery Spike Test Configuration
# Tests system behavior under sudden traffic spikes

config:
  target: 'http://localhost:8000'
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Warm up"
    - duration: 10
      arrivalRate: 200
      name: "Sudden spike"
    - duration: 30
      arrivalRate: 5
      name: "Recovery"
    - duration: 10
      arrivalRate: 300
      name: "Second spike"
    - duration: 30
      arrivalRate: 5
      name: "Final recovery"
  defaults:
    headers:
      Content-Type: 'application/json'
  plugins:
    metrics-by-endpoint: {}
    expect: {}

scenarios:
  - name: "Spike Health Checks"
    weight: 30
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200

  - name: "Spike User Registration"
    weight: 25
    flow:
      - post:
          url: "/api/v1/auth/register"
          json:
            email: "spike{{ $randomString() }}@example.com"
            password: "SpikePassword123!"
            full_name: "Spike User {{ $randomString() }}"
            mobile_phone: "+123456789{{ $randomInt(1000, 9999) }}"
          expect:
            - statusCode: 201

  - name: "Spike Document Operations"
    weight: 20
    flow:
      - post:
          url: "/api/v1/documents/upload"
          formData:
            file: "@tests/fixtures/sample.pdf"
          expect:
            - statusCode: 200

  - name: "Spike Chat Messages"
    weight: 15
    flow:
      - post:
          url: "/api/v1/chat/message"
          json:
            message: "Spike test message {{ $randomString() }}"
            session_id: "spike-session-{{ $randomString() }}"
          expect:
            - statusCode: 200

  - name: "Spike Analytics"
    weight: 10
    flow:
      - get:
          url: "/api/v1/analytics/overview"
          expect:
            - statusCode: 200