tests/performance/spike-test.yml
config:
  target: 'http://localhost:8000'
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Normal load"
    - duration: 10
      arrivalRate: 200
      name: "Spike"
    - duration: 30
      arrivalRate: 5
      name: "Normal load"
    - duration: 10
      arrivalRate: 300
      name: "Big spike"
    - duration: 30
      arrivalRate: 5
      name: "Normal load"
  defaults:
    headers:
      Content-Type: 'application/json'

scenarios:
  - name: "Spike Health Checks"
    weight: 50
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200

  - name: "Spike API Calls"
    weight: 50
    flow:
      - get:
          url: "/api/v1/health"
          expect:
            - statusCode: 200