tests/performance/stress-test.yml
config:
  target: 'http://localhost:8000'
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Warm up"
    - duration: 60
      arrivalRate: 50
      name: "High load"
    - duration: 120
      arrivalRate: 100
      name: "Stress test"
    - duration: 60
      arrivalRate: 5
      name: "Cool down"
  defaults:
    headers:
      Content-Type: 'application/json'

scenarios:
  - name: "High Frequency Health Checks"
    weight: 30
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200

  - name: "Concurrent API Calls"
    weight: 40
    flow:
      - get:
          url: "/api/v1/health"
          expect:
            - statusCode: 200
      - get:
          url: "/ready"
          expect:
            - statusCode: 200

  - name: "Authentication Stress"
    weight: 30
    flow:
      - post:
          url: "/api/v1/auth/register"
          json:
            email: "stress{{ $randomInt(1, 100000) }}@example.com"
            password: "StressTest123!"
            full_name: "Stress User {{ $randomInt(1, 100000) }}"
          expect:
            - statusCode: [200, 201, 400, 409]