tests/performance/volume-test.yml
config:
  target: 'http://localhost:8000'
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 600
      arrivalRate: 30
      name: "Sustained volume"
    - duration: 60
      arrivalRate: 10
      name: "Cool down"
  defaults:
    headers:
      Content-Type: 'application/json'

scenarios:
  - name: "Volume Health Checks"
    weight: 30
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200

  - name: "Volume API Calls"
    weight: 40
    flow:
      - get:
          url: "/api/v1/health"
          expect:
            - statusCode: 200
      - get:
          url: "/ready"
          expect:
            - statusCode: 200

  - name: "Volume Authentication"
    weight: 30
    flow:
      - post:
          url: "/api/v1/auth/register"
          json:
            email: "volume{{ $randomInt(1, 1000000) }}@example.com"
            password: "VolumeTest123!"
            full_name: "Volume User {{ $randomInt(1, 1000000) }}"
          expect:
            - statusCode: [200, 201, 400, 409]